### Chapter 4 - Categorical Data Encoding

#### 4.2. One hot Encoding

In [1]:
import matplotlib.pyplot as plt
import seaborn as sns

plt.rcParams["figure.figsize"] = [8,6]
sns.set_style("darkgrid")

titanic_data = sns.load_dataset('titanic')

titanic_data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
titanic_data  = titanic_data[["sex", "class", "embark_town"]]
titanic_data.head()

      sex  class  embark_town
0    male  Third  Southampton
1  female  First    Cherbourg
2  female  Third  Southampton
3  female  First  Southampton
4    male  Third  Southampton

In [3]:
print(titanic_data['sex'].unique())
print(titanic_data['class'].unique())
print(titanic_data['embark_town'].unique())

['male' 'female']
[Third, First, Second]
Categories (3, object): [Third, First, Second]
['Southampton' 'Cherbourg' 'Queenstown' nan]

In [4]:
import pandas as pd
temp = pd.get_dummies(titanic_data['sex'])

temp.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [5]:
pd.concat([titanic_data['sex'],
           pd.get_dummies(titanic_data['sex'])], axis=1).head()

      sex  female  male
0    male       0     1
1  female       1     0
2  female       1     0
3  female       1     0
4    male       0     1

In [6]:
import pandas as pd
temp = pd.get_dummies(titanic_data['embark_town'])

temp.head()

   Cherbourg  Queenstown  Southampton
0          0           0            1
1          1           0            0
2          0           0            1
3          0           0            1
4          0           0            1

In [7]:
import pandas as pd
temp = pd.get_dummies(titanic_data['embark_town'], drop_first = True)

temp.head()

   Queenstown  Southampton
0           0            1
1           0            0
2           0            1
3           0            1
4           0            1

In [8]:
import pandas as pd
temp = pd.get_dummies(titanic_data['embark_town'], dummy_na = True ,drop_first = True)

temp.head()

   Queenstown  Southampton  NaN
0           0            1    0
1           0            0    0
2           0            1    0
3           0            1    0
4           0            1    0

#### 4.3. Label Encoding

In [9]:
# for integer encoding using sklearn
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

le.fit(titanic_data['class'])

titanic_data['le_class'] = le.transform(titanic_data['class'])

titanic_data.head()

      sex  class  embark_town  le_class
0    male  Third  Southampton         2
1  female  First    Cherbourg         0
2  female  Third  Southampton         2
3  female  First  Southampton         0
4    male  Third  Southampton         2

In [10]:
le.classes_

array(['First', 'Second', 'Third'], dtype=object)

#### 4.4. Frequency Encoding

In [11]:
titanic_data.dropna(inplace = True)

In [12]:
value_counts = titanic_data['embark_town'].value_counts().to_dict()
print(value_counts)

{'Southampton': 644, 'Cherbourg': 168, 'Queenstown': 77}

In [13]:
titanic_data['embark_town'] = titanic_data['embark_town'].map(value_counts)
titanic_data.head()

      sex  class  embark_town  le_class
0    male  Third          644         2
1  female  First          168         0
2  female  Third          644         2
3  female  First          644         0
4    male  Third          644         2

In [14]:
frequency_count = (titanic_data['embark_town'].value_counts() / len(titanic_data) ).to_dict()
print(frequency_count)

{644: 0.7244094488188977, 168: 0.1889763779527559, 77: 0.08661417322834646}

In [15]:
titanic_data['embark_town'] = titanic_data['embark_town'].map(frequency_count)
titanic_data.head()

      sex  class  embark_town  le_class
0    male  Third     0.724409         2
1  female  First     0.188976         0
2  female  Third     0.724409         2
3  female  First     0.724409         0
4    male  Third     0.724409         2

#### 4.5. Ordinal Encoding

In [16]:
titanic_data = sns.load_dataset('titanic')
titanic_data  = titanic_data[["sex", "class", "embark_town", "survived"]]


titanic_data.groupby(['class'])['survived'].mean().sort_values()

class
Third     0.242363
Second    0.472826
First     0.629630
Name: survived, dtype: float64

In [17]:
ordered_cats = titanic_data.groupby(['class'])['survived'].mean().sort_values().index
cat_map= {k: i for i, k in enumerate(ordered_cats, 0)}
titanic_data['class_ordered'] = titanic_data['class'].map(cat_map)

In [18]:
titanic_data.head()

      sex  class  embark_town  survived class_ordered
0    male  Third  Southampton         0             0
1  female  First    Cherbourg         1             2
2  female  Third  Southampton         1             0
3  female  First  Southampton         1             2
4    male  Third  Southampton         0             0

#### 4.6 Mean Encoding

In [20]:
titanic_data.groupby(['class'])['survived'].mean()

class
First     0.629630
Second    0.472826
Third     0.242363
Name: survived, dtype: float64

In [23]:
mean_labels = titanic_data.groupby(['class'])['survived'].mean().to_dict()
titanic_data['class_mean'] = titanic_data['class'].map(mean_labels)
titanic_data.head()

      sex  class  embark_town  survived class_ordered class_mean
0    male  Third  Southampton         0             0   0.242363
1  female  First    Cherbourg         1             2   0.629630
2  female  Third  Southampton         1             0   0.242363
3  female  First  Southampton         1             2   0.629630
4    male  Third  Southampton         0             0   0.242363

### Exercise 4.1

#### Question 1

Which encoding scheme generally leads to highest number of columns in the encoded dataset?

A. Mean Encoding \
B. Ordinal Encoding \
C. One Hot Encoding \
D. All of the Above

Answer: C

#### Question 2

Which attribute is set to True to remove the first column from the one-hot encoded columns generated via get_dummies() method?

A. drop_first \
B. remove_first \
C. delete_first \
D. None of the above

Answer: A

#### Question 3

What is the total number of integer labels in the frequency encoding?

A. One less than total number of unique labels in the original column \
B. Equal to the  total number of unique labels in the original column  \
C. 3 \
D. None of the above

Answer: B

### Exercise 4.2

Apply frequency encoding to the class column of the Titanic Dataset:

In [28]:
import matplotlib.pyplot as plt
import seaborn as sns

plt.rcParams["figure.figsize"] = [8,6]
sns.set_style("darkgrid")

titanic_data = sns.load_dataset('titanic')

titanic_data.head()

titanic_data  = titanic_data[["sex", "class", "embark_town"]]
titanic_data.head()

value_counts = titanic_data['class'].value_counts().to_dict()
print(value_counts)

titanic_data['class_freq'] = titanic_data['class'].map(value_counts)
titanic_data.head()

{'Third': 491, 'First': 216, 'Second': 184}

      sex  class  embark_town class_freq
0    male  Third  Southampton        491
1  female  First    Cherbourg        216
2  female  Third  Southampton        491
3  female  First  Southampton        216
4    male  Third  Southampton        491